【課程名稱】<font color=#FF0000>機器學習(Machine Learning, ML)</font><br>
【授課講師】[陳祥輝 (mail : HsiangHui.Chen@gmail.com)](mailto:HsiangHui.Chen@gmail.com)<br>
【facebook】[陳祥輝老師的臉書 (歡迎加好友)](https://goo.gl/osivhx)<br>
【相關課程】[東吳推廣數位資訊學苑陳祥輝老師的課程表](https://www.ext.scu.edu.tw/courses_search.php?key=陳祥輝)<br>

In [2]:
# -*- coding: utf-8 -*-
from platform import python_version
import os, time, glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder, OneHotEncoder

print("【日期時間】{}".format(time.strftime("%Y/%m/%d %H:%M:%S")))
print("【工作目錄】{}".format(os.getcwd()))
print("【Python】{}".format(python_version()))

# %autosave 120

【日期時間】2025/03/21 19:13:29
【工作目錄】C:\Users\NTPU\Downloads
【Python】3.12.4

In [3]:
from matplotlib.font_manager import FontProperties  
winfont01 = FontProperties(fname=r"c:\windows\fonts\simsun.ttc", size=12) 
winfont02 = FontProperties(fname=r"c:\windows\fonts\kaiu.ttf", size=12) 

# plt.rcParams['font.sans-serif'] = ['Microsoft JhengHei']  # 設定字型為微軟正黑體
# plt.rcParams['axes.unicode_minus'] = False                # 解決負號顯示問題

# macfont = FontProperties(fname="/Library/Fonts/Arial Unicode.ttf", size=10)

### <a id=scikit><font color=#0000FF>使用 Scikit-Learn 模組來進行轉換</font></a> [【HOME】](#HOME)
【Sklearn的編碼器】
- LabelEncoder
- OrdinalEncoder
- Binarizer    
- OneHotEncoder

In [4]:
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder, Binarizer, OneHotEncoder

#### <font color=#0000FF>LabelEncoder【Nominal Variable(名目變數)】</font>
- Encode target labels with value between 0 and n_classes-1.

In [5]:
from sklearn.preprocessing import LabelEncoder

In [15]:
# 現在要幫他做編碼的動作惹 這裡是用y去encode
data = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday']
encoder = LabelEncoder()
data_encodered = encoder.fit_transform(data) # 這是按照英文字母排序的
print("【轉換後的結果】")
print(data_encodered)
print("【轉換的對照表】")
print(encoder.classes_)

'''
    encoder 需要把它儲存下來
    雖然他是按照英文字母去排序的，但是你可能會少有幾個星期之類的~
'''

# 票漂亮亮的dataframe
pd.DataFrame(zip(range(len(data)), encoder.classes_), 
             columns=["index", "label"])

【轉換後的結果】
[3 1 5 6 4 0 2]
【轉換的對照表】
['Friday' 'Monday' 'Saturday' 'Sunday' 'Thursday' 'Tuesday' 'Wednesday']

   index      label
0      0     Friday
1      1     Monday
2      2   Saturday
3      3     Sunday
4      4   Thursday
5      5    Tuesday
6      6  Wednesday

[NOTE] .fit_transform() = .fit() + .transorm()

In [16]:
print(encoder.inverse_transform(data_encodered))

['Sunday' 'Monday' 'Tuesday' 'Wednesday' 'Thursday' 'Friday' 'Saturday']

#### <font color=#0000FF>OrdinalEncoder【Ordinal Variable(有序變數)】</font>

In [17]:
from sklearn.preprocessing import OrdinalEncoder

> #### 自動排序

In [18]:
data = np.array([['Sunday', "1"], ['Monday', "2"], ['Tuesday', "3"], ['Wednesday', "4"], 
                 ['Thursday', "5"], ['Friday', "6"], ['Saturday', "7"]])
pd.DataFrame(data)

           0  1
0     Sunday  1
1     Monday  2
2    Tuesday  3
3  Wednesday  4
4   Thursday  5
5     Friday  6
6   Saturday  7

In [19]:
from pprint import pprint
data = np.array([['Sunday', "1"], ['Monday', "2"], ['Tuesday', "3"], ['Wednesday', "4"], 
                 ['Thursday', "5"], ['Friday', "6"], ['Saturday', "7"]])

encoder = OrdinalEncoder(categories='auto')
data_encoded = encoder.fit_transform(data)
print(data_encoded)
pprint(encoder.categories_)

[[3. 0.]
 [1. 1.]
 [5. 2.]
 [6. 3.]
 [4. 4.]
 [0. 5.]
 [2. 6.]]
[array(['Friday', 'Monday', 'Saturday', 'Sunday', 'Thursday', 'Tuesday',
       'Wednesday'], dtype='<U9'),
 array(['1', '2', '3', '4', '5', '6', '7'], dtype='<U9')]

> #### 自訂順序

In [20]:
data = np.array([['Sunday', "1"], ['Monday', "2"], ['Tuesday', "3"], ['Wednesday', "4"], 
                 ['Thursday', "5"], ['Friday', "6"], ['Saturday', "7"]])

encoder = OrdinalEncoder(categories=[['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
                                     ["7", "6", "5", "4", "3", "2", "1"]])

data_encoded = encoder.fit_transform(data)
print(data_encoded)
pprint(encoder.categories_)

[[6. 6.]
 [0. 5.]
 [1. 4.]
 [2. 3.]
 [3. 2.]
 [4. 1.]
 [5. 0.]]
[array(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday',
       'Sunday'], dtype=object),
 array(['7', '6', '5', '4', '3', '2', '1'], dtype=object)]

### <font color='blue'>針對DataFrame的某些 columns 進行編碼</font>

In [32]:
import pandas as pd
df = pd.DataFrame({
    "No":[1,2,3,4,5,6,7],
    "Name":["Tom","Harry","John","Nancy","Mike","Kate","Mary"],
    "Sex":["M","M","M","F","M","F","F"],
    "Blood":["O","A","A","B","O","AB","O"],
    "Grade":[56,76,45,78,79,66,99],
    "Height":[160,192,178,157,167,156,166],
    "Study":["Math","Math","English","Biology","Math","English","Science"]
})

df

   No   Name Sex Blood  Grade  Height    Study
0   1    Tom   M     O     56     160     Math
1   2  Harry   M     A     76     192     Math
2   3   John   M     A     45     178  English
3   4  Nancy   F     B     78     157  Biology
4   5   Mike   M     O     79     167     Math
5   6   Kate   F    AB     66     156  English
6   7   Mary   F     O     99     166  Science

> #### 自動排序

In [33]:
encoder = OrdinalEncoder(categories='auto')
df_auto = df.copy()
df_auto[["Sex", "Blood"]] = encoder.fit_transform(df_auto[["Sex", "Blood"]])
df_auto

   No   Name  Sex  Blood  Grade  Height    Study
0   1    Tom  1.0    3.0     56     160     Math
1   2  Harry  1.0    0.0     76     192     Math
2   3   John  1.0    0.0     45     178  English
3   4  Nancy  0.0    2.0     78     157  Biology
4   5   Mike  1.0    3.0     79     167     Math
5   6   Kate  0.0    1.0     66     156  English
6   7   Mary  0.0    3.0     99     166  Science

> #### 自訂順序

In [34]:
encoder = OrdinalEncoder(categories=[["F", "M"], 
                                     ["A", "B", "O", "AB"]])
df[["Sex", "Blood"]] = encoder.fit_transform(df[["Sex", "Blood"]])
df

   No   Name  Sex  Blood  Grade  Height    Study
0   1    Tom  1.0    2.0     56     160     Math
1   2  Harry  1.0    0.0     76     192     Math
2   3   John  1.0    0.0     45     178  English
3   4  Nancy  0.0    1.0     78     157  Biology
4   5   Mike  1.0    2.0     79     167     Math
5   6   Kate  0.0    3.0     66     156  English
6   7   Mary  0.0    2.0     99     166  Science

> #### 還原成原本的資料

In [35]:
encoder.inverse_transform(df[["Sex", "Blood"]])

array([['M', 'O'],
       ['M', 'A'],
       ['M', 'A'],
       ['F', 'B'],
       ['M', 'O'],
       ['F', 'AB'],
       ['F', 'O']], dtype=object)

#### <font color=#0000FF>Binarizer</font>

#### <font color=#0000FF>【heartdisease資料集】</font>
該數據庫包含76個屬性，但在所有已發布的實驗中，我們使用其中14個屬性的子集。 特別是，克利夫蘭數據庫是ML研究人員迄今為止唯一使用過的數據庫。 “目標”num是指患者中存在心臟病。 它的整數值從0（無存在）到4.克利夫蘭數據庫的實驗集中於簡單地嘗試區分存在（值1,2,3,4）和不存在（值0）。
- [heartdisease資料來源](https://archive.ics.uci.edu/ml/machine-learning-databases/heart-disease/processed.cleveland.data)

---

1. age : Age of patient
2. sex : (value 1: Male; value 0 : Female)
3. cp : Chest Pain Type (胸痛類型)
    - value 1: typical type 1 angina (典型的1型心絞痛)
    - value 2: typical type angina (典型的心絞痛)
    - value 3: non-angina pain (非心絞痛)
    - value 4: asymptomatic (無症狀)
4. trestbps : Treat Blood Pressure (mm Hg on admission to the hospital)
 (治療血壓，入院時)
5. chol : Serum Cholesterol (mg/dl) (血清膽固醇)
6. fbs : Fasting Blood Sugar (空腹血糖)
    - value 1: > 120 mg/dl
    - value 0: < 120 mg/dl)
7. restecg : resting electrographic results (靜息電圖結果)
    - value 0: normal
    - value 1: 1 having ST-T wave abnormality
    - value 2: showing probable or definite left ventricular hypertrophy
8. thalach : maximum heart rate achieved (最大心率)
9. exang : exercise induced angina (運動誘發心絞痛)
    - value 1: yes
    - value 0: no
10. oldpeak : ST depression induced by exercise relative to rest (運動引起ST段壓低相對於休息)  
11. slope : slope of peak exercise ST (高峰運動ST的斜率)
    - value 1: unsloping
    - value 2: flat
    - value 3: downsloping
12. ca : number of major vessel (value 0 – 3) (主要導管數量)
13. thal : Thal (地中海型貧血)
    - value 3: normal (正常)
    - value 6: fixed defect (固定缺陷)
    - value 7: reversible defect (可逆缺陷)
14. num : 
    - value 0 : 沒有心臟病
    - Value 1-4 : 有心臟病

【NOTE】將 num 分為 0(沒有心臟病), 1(有心臟病) 兩類

In [36]:
from sklearn.preprocessing import Binarizer

In [37]:
fname = "C:/Data/PyMLData/heart_disease.data"
colnames = ['age', 'sex', 'cp', 'trestbps', 'chol', 
            'fbs', 'restecg', 'thalach', 'exang', 'oldpeak', 
            'slope', 'ca', 'thal', 'num']

data = pd.read_csv(fname, sep=',', encoding='utf-8', engine='python', names=colnames)

print(data.shape)
data.head(3)

(303, 14)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,63.0,1.0,1.0,145.0,233.0,1.0,2.0,150.0,0.0,2.3,3.0,0.0,6.0,0
1,67.0,1.0,4.0,160.0,286.0,0.0,2.0,108.0,1.0,1.5,2.0,3.0,3.0,2
2,67.0,1.0,4.0,120.0,229.0,0.0,2.0,129.0,1.0,2.6,2.0,2.0,7.0,1

> #### 三種方式讓它們變成掰呢瑞

In [39]:
encoder = Binarizer(threshold=0.0)
data_fit = data.copy()
data_fit["num"] = encoder.fit_transform(np.array(data_fit["num"]).reshape(-1, 1))
data_fit.head(3)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,63.0,1.0,1.0,145.0,233.0,1.0,2.0,150.0,0.0,2.3,3.0,0.0,6.0,0
1,67.0,1.0,4.0,160.0,286.0,0.0,2.0,108.0,1.0,1.5,2.0,3.0,3.0,1
2,67.0,1.0,4.0,120.0,229.0,0.0,2.0,129.0,1.0,2.6,2.0,2.0,7.0,1

#### 比較以下兩個的差異
- DataFrame.where() : Replace values where the condition is False
- DataFrame.mask() : Replace values where the condition is True.

In [40]:
# 講人話 : num 如果等於 0 就不變，其他的改成 1
data_where = data.copy()
data_where["num"].where(data_where["num"]==0, 1, inplace=False).head(5)

0    0
1    1
2    1
3    0
4    0
Name: num, dtype: int64

In [41]:
# 講人話 : num 如果不等於 0 就改成 1
data_mask = data.copy()
data_mask["num"].mask(data_mask["num"]!=0, 1, inplace=False).head(5)

0    0
1    1
2    1
3    0
4    0
Name: num, dtype: int64

#### <font color=#0000FF>OneHotEncoder 老師不喜歡他 老師喜歡當米</font>

In [43]:
from sklearn.preprocessing import OneHotEncoder

In [42]:
data = np.array(['Sunday', 'Monday', 'Tuesday', 'Wednesday', 
                 'Thursday', 'Friday', 'Saturday']).reshape((-1, 1))

### <font color='red'>One-Hot Encoding vs Dummy Variables</font>
- By default, the get_dummies() does not do dummy encoding, but one-hot encoding.
- To produce an actual dummy encoding from your data, use drop_first=True (not that 'australia' is missing from the columns)

In [44]:
df = pd.DataFrame({'country': ['russia', 'germany', 'australia','korea','germany']})
df

     country
0     russia
1    germany
2  australia
3      korea
4    germany

In [45]:
pd.get_dummies(df['country'], prefix='country', drop_first=False)

   country_australia  country_germany  country_korea  country_russia
0              False            False          False            True
1              False             True          False           False
2               True            False          False           False
3              False            False           True           False
4              False             True          False           False

In [46]:
pd.get_dummies(df["country"],prefix='country',drop_first=True)

   country_germany  country_korea  country_russia
0            False          False            True
1             True          False           False
2            False          False           False
3            False           True           False
4             True          False           False

### <font color='red'>資料的切割，pandas的 cut() 與 qcut()</font>
- [pandas的cut&qcut函數](https://medium.com/@morris_tai/pandas%E7%9A%84cut-qcut%E5%87%BD%E6%95%B8-93c244e34cfc)

In [47]:
titanic = pd.read_csv(r'C:/Data/PyMLData/titanic.csv', sep=',', encoding='cp950', engine='python')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### <font color='blue'>使用 pd.cut( ) 區間切割</font>

In [48]:
pd.cut(titanic["Age"], 
       bins=[0, 20, 40, 60, 80, 100],
       right = True,                  # right = True 右邊為 閉區間
       labels=None,)

0      (20.0, 40.0]
1      (20.0, 40.0]
2      (20.0, 40.0]
3      (20.0, 40.0]
4      (20.0, 40.0]
           ...
151    (20.0, 40.0]
152    (40.0, 60.0]
153    (40.0, 60.0]
154             NaN
155    (40.0, 60.0]
Name: Age, Length: 156, dtype: category
Categories (5, interval[int64, right]): [(0, 20] < (20, 40] < (40, 60] < (60, 80] < (80, 100]]

#### <font color='blue'>使用 pd.cut( ) 區間切割，並且給標籤</font>

In [49]:
pd.cut(titanic["Age"], 
       bins=[0, 20, 40, 60, 80, 100],
       right = True,                  # right = True 右邊為 閉區間
       labels=["青少年", "壯年", "中年", "老年", "老老年"],)

0       壯年
1       壯年
2       壯年
3       壯年
4       壯年
      ...
151     壯年
152     中年
153     中年
154    NaN
155     中年
Name: Age, Length: 156, dtype: category
Categories (5, object): ['青少年' < '壯年' < '中年' < '老年' < '老老年']

In [50]:
# 變成直接編碼就不用再編碼一次了
pd.cut(titanic["Age"], 
       bins=[0, 20, 40, 60, 80, 100],
       right = True,                  # right = True 右邊為 閉區間
       labels=[0, 1, 2, 3, 4],)

0        1
1        1
2        1
3        1
4        1
      ...
151      1
152      2
153      2
154    NaN
155      2
Name: Age, Length: 156, dtype: category
Categories (5, int64): [0 < 1 < 2 < 3 < 4]

#### <font color='blue'>使用 pd.qcut( ) 區間切割</font>
- q : 給定整數，就是代表標準的分位數，例如 4 : 四分位數， 10 : 十分位數
- q : 給定list，可以自訂分位數，例如 [0, .25, .5, .75, 1.] for quartiles

In [51]:
pd.qcut(titanic["Age"], 
        q=4,
        labels=None,)

0      (19.0, 26.0]
1      (35.0, 71.0]
2      (19.0, 26.0]
3      (26.0, 35.0]
4      (26.0, 35.0]
           ...
151    (19.0, 26.0]
152    (35.0, 71.0]
153    (35.0, 71.0]
154             NaN
155    (35.0, 71.0]
Name: Age, Length: 156, dtype: category
Categories (4, interval[float64, right]): [(0.829, 19.0] < (19.0, 26.0] < (26.0, 35.0] < (35.0, 71.0]]

#### <font color='blue'>使用 pd.qcut( ) 區間切割，並且給標籤</font>

In [52]:
pd.qcut(titanic["Age"], 
        q=4,
        labels=[0, 1, 2, 3],)

0        1
1        3
2        1
3        2
4        2
      ...
151      1
152      3
153      3
154    NaN
155      3
Name: Age, Length: 156, dtype: category
Categories (4, int64): [0 < 1 < 2 < 3]